#include <iostream>
#include <vector>
using namespace std;

int main() {
    vector<int> numbers;  // сюда будем сохранять все числа
    int x;
    while (cin >> x) {
        numbers.push_back(x);  // добавляем число в вектор
    }
    int i;
    while(i <)

}

// Тут наша задача получить введенные числа, и понять все ли хорошо прошло. В действительности задача итак нам говорит что нам дается перестоновка, поэтому проверять общие число введенных чисел не надо
// Мы получили пересоновку, теперь на сколько я понимаю мы должны выбрать i, позже